attacker/data/nothing/spoofing/ab_results/ab_40.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   43.891 seconds
Complete requests:      20
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Keep-Alive requests:    11
Total transferred:      2684 bytes
HTML transferred:       1045 bytes
Requests per second:    0.46 [#/sec] (mean)
Time per request:       21945.543 [ms] (mean)
Time per request:       2194.554 [ms] (mean, across all concurrent requests)
Transfer rate:          0.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   2.3      3      10
Processing:     3 13564 12884.9  22907   28669
Waiting:        0 13562 12886.9  22907   28669
Total:          4 13568 12884.8  22911   28672

Percentage of the requests served within a certain time (ms)
  50%  22911
  66%  24193
  75%  25348
  80%  26626
  90%  28672
  95%  28672
  98%  28672
  99%  28672
 100%  28672 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...apr_pollset_poll: The timeout specified has expired (70007)
